//ДЗ 7. Практика на роботу з циклами
//№1 Вивести на сторінку в один рядок через кому числа від 10 до 20
let arr = [];

for (i = 10; i <= 20; i++) {
  arr.push(i)    
};

console.log(arr);  
//якщо потрібно, то можна вивести не як масив
alert(arr);


//№2 Вивести квадрати чисел від 10 до 20
let arr2 = [];

for (i = 10; i <= 20; i++) {
  arr2.push(i**2)    
};

console.log(arr2);  


//№3 Вивести таблицю множення на 7

for (i=1; i < 11; i++) {
  let mult = 7 * i;
  console.log(`7 * ${i} = ${mult} `)
};

//№4 Знайти суму всіх цілих чисел від 1 до 15
let sum = 0;
for (j=1; j <= 15; j++) {
  sum += j; 
};

console.log(sum);

//№5 Знайти добуток усіх цілих чисел від 15 до 35
 let mult2 = 1;

 for (j=15; j <= 35; j++) {
  mult2 *= j; 
};

console.log(mult2);

//№6 Знайти середнє арифметичне всіх цілих чисел від 1 до 500
let sum2 = 0;
for (j=1; j <= 500; j++) {
  sum2 += j; 
};

console.log(sum2 / 500);

//№7 Вивести суму лише парних чисел у діапазоні від 30 до 80
let sum3 = 0;
for (j=30; j <= 80; j++) {
  if (j % 2 == 0) {
    sum3 += j;
  }   
};

console.log(sum3);

//№8 Вивести всі числа в діапазоні від 100 до 200 кратні 3
for (i = 100; i <= 200; i++) {
 if (i % 3 == 0 ){
  console.log(i);
 }
}



//№9 Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
let n = prompt('Введіть натуральне число', '24');
let arr3 = [];

for (i = 1; i <= n; i++) {
  if (n % i == 0) {
  arr3.push(i)
  }    
};

console.log(arr3);  

//№10 Визначити кількість його парних дільників
let n2 = prompt('Введіть натуральне число', '18');
let arr4 = [];

for (i = 1; i <= n; i++) {
  if (n2 % i == 0 && i % 2 == 0) {
  arr4.push(i)
  }    
};
console.log(arr4); 
console.log(arr4.length);


// №11 (продовження завдання 10) Знайти суму його парних дільників
let resSum = arr4.reduce(function(sum, elem) {
	return sum + elem;
}, 0);

console.log(resSum);


//№12 Надрукувати повну таблицю множення від 1 до 10

for (var i=2; i<=10; i++) { 

  let j = 1
  while (j<=10) {
    console.log(i + " * " + j + " = " + i*j );
    j++;
  }
};